class Team_dict():
    def __init__(self):
        pass

    @staticmethod
    def team_dict(value):
        dic = {

#联赛
                '西甲':'ئىسپانىيەبىرلاشمىسى' , '德甲':'گىرمانىيەبىرلاشمىسى','K联赛':'كورىيەبىرلاشمىسى',
                '意甲':'ئىتالىيەبىرلاشمىسى', '法甲':'فىرانىسىيەبىرلاشمىسى', '英超':'ئەنگىليەبىرلەشمىسى ',
                '中超':'جۇڭگۇدەرىجىدىن تاشقىرى',

#英超
               '利物浦': 'لىۋېرپول', '曼城': 'مانچېستېر شەھىرى', '莱斯特城': ' لېستىر شەھىرى',
               '切尔西': 'چېلسى', '曼联': 'مانچېستىر بىرلەشمىسى', '狼队': 'بۆرە كوماندىسى',
               '谢菲尔德联': 'شېفېلد بىرلەشمىسى', '托特纳姆热刺': 'توتىنھام', '阿森纳': ' ئارسېنال',
               '伯恩利': 'بېرنلېي', '水晶宫': ' خرۇستال ئوردا', '埃弗顿': 'ئېۋېرتون',
               '纽卡斯尔联': 'نېۋكاستل بىرلەشمىسى', '南安普顿': ' جەنۇبىي ئامپتون',
               '布莱顿': 'بىلېتون', '西汉姆联': 'غەربى ھام', '沃特福德': 'ۋورتستون',
               '伯恩茅斯': 'بۇرنېموس', '阿斯顿维拉': 'ئاستون ۋىللا', '诺维奇': 'نوۋىچ',

#西甲
               '巴塞罗那': 'بارسېلونا', '皇家马德里': 'خانلىق مادرىد', '塞维利亚': 'سېۋىللا',
               '皇家社会': 'خانلىق جەمىيەت', '赫塔费': 'خېتافې', '马德里竞技': 'مادرىد ئاتلېتكا',
               '瓦伦西亚': 'ۋالېنسىيا', '比利亚雷亚尔': 'بىليارېيال', '格拉纳达': 'گرېنادا',
               '毕尔巴鄂竞技': 'بىلباۋ ئاتلېتكا', '奥萨苏纳': 'ئوساسۇنا ', '皇家贝蒂斯': 'خانلىق بېتىس',
               '莱万特': 'لېۋانت', '阿拉维斯': 'ئالاۋىس', '巴拉多利德': 'بالادولىد', '埃瓦尔': 'ئېۋار',
               '塞尔塔': 'سېلتا', '马略卡': 'ماللوكا', '莱加内斯': 'لېگانېس', '西班牙人': 'ئىسپانىيەلىكلەر',

#意甲
               '尤文图斯': 'يۇۋېنتۇس', '拉齐奥': 'لازىئو', '国际米兰': 'خەلقارا مىلان', '亚特兰大': 'ئاتلانتا',
               '罗马': 'رىم', '那不勒斯': 'ناپلېس', 'AC米兰': 'مىلان AC', '维罗纳': 'ۋىرونا', '帕尔马': 'پارما',
               '博洛尼亚': 'بولونىيا', '萨索洛': 'ساسولو', '卡利亚里': 'كالىيال', '佛罗伦萨': 'فىلورېنسا',
               '乌迪内斯': 'ئۇدىنېس', '都灵': 'تۇرىن', '桑普多利亚': 'سامپدورىيا', '热那亚': 'رىنايا', '莱切': 'لىيىچ',
               '斯帕尔': 'سىپار', '布雷西亚': 'برېسىيە',

#德甲
               '拜仁慕尼黑': 'بايرېن مىيۇنخېن', '多特蒙德': 'دورتمۇند', 'RB莱比锡': 'لېيپسىگ RB',
               '门兴格拉德巴赫': 'مىنشىنگىلادباخ', '勒沃库森': 'لېۋېركۇسېن', '沙尔克04': 'شالىك 04',
               '沃尔夫斯堡': 'ۋولفسبۇرگ', '弗赖堡': 'فرېيبۇرگ', '霍芬海姆': 'خوففېنھام', '科隆': 'كولون',
               '柏林联合': 'بېرلىن بىرلەشمىسى', '法兰克福': 'فىرانكفورت', '柏林赫塔': 'بېرلىن خېتا',
               '奥格斯堡': 'ئاۋگس قەلىئەسى', '美因茨': 'مېيىنتس', '杜塞尔多夫': 'دۇسسېلدورف',
               '云达不莱梅': 'ۋىردىربىرمىن', '帕德博恩': 'پادبوئىن',

#法甲
               '巴黎圣日耳曼': 'پارىژ سانت گېرمان', '马赛': 'مارسېل', '雷恩': 'رېئىن', '里尔': 'لىيىر',
               '兰斯': 'لانس', '尼斯': 'نىس', '里昂': 'لىئون', '蒙彼利埃': 'مونتىپىلىر', '摩纳哥': 'موناكو',
               '昂热': 'ئەنجىرىس', '斯特拉斯堡': 'ستراسبۇرگ', '波尔多': 'بوردو', '南特': 'نانت', '布雷斯特': 'برېست',
               '梅斯': 'مېس', '第戎': 'دىجان', '圣埃蒂安': 'سان ئېدتىئان', '尼姆': 'نىم', '亚眠': 'فۇفانا',
               '图卢兹':'تۇلۇس',
    

#韩国
                '蔚山现代':'خىيوندى',    '江原':'چىياڭۋىن',    '浦项制铁':'پۇجىيوڭ چىيىل',  '城南':'سىيوڭ نام',
                '全北现代':'جىيون بۇك',  '大邱':'تىگو',
                '仁川联':'ئىنچنيۇەن',     '首尔':'سىول',      '水原三星':'سۇۋىن مامسوڭ',  '釜山IPark':'پۇسان',
                '光州':'كۇاڭجىيۇ',    '尚州尚武':'سانجى سانمۇ',


#中超
                '北京中赫国安':"بېيجىڭ گوئەن",    '重庆当代':'چۇڭچىڭ ',    '大连人':'داليەنلىكلەر',   '广州恒大淘宝':"گۇاڭجۇ خېڭدا",
                '广州富力':"گۇاڭجۇ فۇلى",   '河北华夏幸福':"خېبېي خۇاشيا",     '河南建业':'خېنەن جيەنيې',
                '江苏苏宁':"جياڭسۇسۇنىڭ",    '青岛黄海青港':"چىڭداۋ خۇاڭخەي", '山东鲁能泰山':"شەندۇڭ لۇنېڭ",
                '上海上港':"شاڭخەي شاڭگاڭ",    "上海绿地申花":"شاڭخەي شېنخۇا",    "石家庄永昌":"شىجياجۇاڭ يۇڭچاڭ",
                "天津泰达":"تيەنجىن تەيدا",      '天津天海':"تيەنجىن تيەنخەي",     '武汉卓尔':'ۋۇخەن جوئىر',


#土耳其
                '特拉布宗体育':'تىرازبون تەنتەربىيەسى',    '伊斯坦布尔':'ئىستانبول',  "加拉塔萨雷":"گالاتاساراي",
                "锡瓦斯体育":"سىۋاس تەنتەربىيەسى",     "贝西克塔斯":"بىشىكتاش",
                "阿拉尼亚体育":"ئالانىيە تەنتەربىيەسى ",     "费内巴切":"فىنىرباغ",   "哥兹塔比":"كوزتابى",
                "加济安泰普大都会":"غازىئانتېپ ",   "安塔利亚体育":"ئانتالىيە تەنتەربىيىسى",    "青年联合":"ياشلار بىرلەشمىسى",
                "卡斯帕萨":"كاسپاسسا",  "科尼亚体育":"كونيا تەنتەربىيىسى",   "马拉蒂亚体育 ":"مالاتىيە تەنتەربىيىسى",
                "代尼兹利体育":"دېنىزلېي تەنتەربىيىسى",    "里泽体育":"رىزې تەنتەربىيىسى",      "安卡拉古库":"ئەنقەرە",
                "开塞利体育":"كېسېلى تەنتەربىيىسى",

#比赛页面
            
                "经典回顾":"كىلاسسىك مۇسابىقىلەر","英雄联盟":"LOL",'KPL':"KPL",'k联赛':"كورىيە بىرلاشمىسى",
                '友谊赛':'دوسىتلۇق مۇسابىقسى','足球电竞职业联赛':"fifa",'懂球帝PP小程序':'دوڭچىيۇدى ئەپچاق',
                '懂球帝TV':"TVدوڭچىيۇدى",
                "直播信息待更新":"ئۇچۇر يىڭلىنىۋاتىدۇ","网络直播":"بىۋاستە تارقىتىش",'懂球帝live':'Live'


        }


        try:
            if dic[value]:
                return dic[value]
            else:
                pass
        except:
            return False

if __name__ == '__main__':
    b = Team_dict()
    item_name = b.team_dict('全北现代')
    if item_name:
        name = item_name
    else:
        name = 'base'
    print(name)